<a href="https://colab.research.google.com/github/da0979217/analisis-de-datos/blob/main/Untitled81.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd


df=pd.read_csv('/content/escolaridad.csv',encoding='latin1')

print(df.head())

print(df.describe())

df.head(5)

df.tail(5)



len(df)

df.shape

  Instituto Nacional de Estadística y Geografía (INEGI)  \
0                                                NaN
1             Fecha de consulta: 01/12/2024 14:01:37
2
3                                           Periodos
4                                               2000

                                          Unnamed: 1  \
0                                                NaN
1                                                NaN
2                                                NaN
3  Demografía y Sociedad > Educación > Tasa neta ...
4                                        49.55943993

                                          Unnamed: 2    Unnamed: 3
0                                                NaN           NaN
1                                                NaN           NaN
2                                                NaN           NaN
3  Demografía y Sociedad > Educación > Tasa neta ...  6.000000e+09
4                                        99.57166464           NaN
         Unnamed: 3
count  1.000000e+00
mean   6.000000e+09
std             NaN
min    6.000000e+09
25%    6.000000e+09
50%    6.000000e+09
75%    6.000000e+09
max    6.000000e+09

(28, 4)

In [11]:
df.dtypes

Instituto Nacional de Estadística y Geografía (INEGI)     object
Unnamed: 1                                                object
Unnamed: 2                                                object
Unnamed: 3                                               float64
dtype: object

In [13]:

df.shape

(28, 4)

In [14]:
df=df.drop_duplicates()

In [15]:
df.shape

(28, 4)

In [16]:
df.count

<bound method DataFrame.count of    Instituto Nacional de Estadística y Geografía (INEGI)  \
0                                                 NaN
1              Fecha de consulta: 01/12/2024 14:01:37
2
3                                            Periodos
4                                                2000
5                                                2001
6                                                2002
7                                                2003
8                                                2004
9                                                2005
10                                               2006
11                                               2007
12                                               2008
13                                               2009
14                                               2010
15                                               2011
16                                               2012
17                                               2013
18                                               2014
19                                               2015
20                                               2016
21                                               2017
22                                               2018
23                                               2019
24                                               2020
25                                               2021
26                                               2022
27  Fuentes: f1/ SEP.  Base de datos del formato 9...

                                           Unnamed: 1  \
0                                                 NaN
1                                                 NaN
2                                                 NaN
3   Demografía y Sociedad > Educación > Tasa neta ...
4                                         49.55943993
5                                         50.01349613
6                                         53.24966629
7                                         55.06144511
8                                         60.16755519
9                                         65.77252027
10                                         69.4485323
11                                        69.60114526
12                                        68.23142053
13                                        67.90930058
14                                        68.48941686
15                                        69.61009945
16                                        70.61718377
17                                        71.14176108
18                                         71.6013267
19                                        71.84844991
20                                        73.86439297
21                                        73.25448024
22                                        71.83304479
23                                        71.43772605
24                                        65.59913909
25                                        63.30735031
26                                        66.57033178
27                                                NaN

                                           Unnamed: 2    Unnamed: 3
0                                                 NaN           NaN
1                                                 NaN           NaN
2                                                 NaN           NaN
3   Demografía y Sociedad > Educación > Tasa neta ...  6.000000e+09
4                                         99.57166464           NaN
5                                          100.281516           NaN
6                                         100.1767384           NaN
7                                         99.80875408           NaN
8                                         99.29805083           NaN
9                                         99.21271533           NaN
10                                        99.73703871           NaN
11                                        99.91119436           NaN
12                                        100.8431698           NaN
13                                         101.407009           NaN
14                                        101.6644927           NaN
15                                        101.6715036           NaN
16                                        100.6938265           NaN
17                                        99.60314312           NaN
18                                        98.74302112           NaN
19                                        98.80937604           NaN
20                                        98.45385104           NaN
21                                           98.48018           NaN
22                                        98.65593434           NaN
23                                        98.32022461           NaN
24                                        97.37049468           NaN
25                                        96.31469543           NaN
26                                        95.77712768           NaN
27                                                NaN           NaN  >

In [17]:
df.isnull().sum()

Instituto Nacional de Estadística y Geografía (INEGI)     1
Unnamed: 1                                                4
Unnamed: 2                                                4
Unnamed: 3                                               27
dtype: int64

In [18]:
df=df.dropna()
df.count

<bound method DataFrame.count of   Instituto Nacional de Estadística y Geografía (INEGI)  \
3                                           Periodos

                                          Unnamed: 1  \
3  Demografía y Sociedad > Educación > Tasa neta ...

                                          Unnamed: 2    Unnamed: 3
3  Demografía y Sociedad > Educación > Tasa neta ...  6.000000e+09  >

In [19]:
df.isnull().sum()

Instituto Nacional de Estadística y Geografía (INEGI)    0
Unnamed: 1                                               0
Unnamed: 2                                               0
Unnamed: 3                                               0
dtype: int64